MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32HG310F64/mcu.h
typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} PRS_CH_TypeDef;

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} DMA_CH_TypeDef;

typedef struct {
  __IOM uint32_t CFG;                                /**< Configuration                                      */
  __IOM uint32_t LOOP;                               /**< Loop Counter                                       */
  __IOM uint32_t CTRL;                               /**< Control                                            */
  __IOM uint32_t SRC;                                /**< Source Address                                     */
  __IOM uint32_t DST;                                /**< Destination Address                                */
  __IOM uint32_t LINK;                               /**< Link Address                                       */
  __IOM uint32_t XCTRL;                              /**< Extended Control                                   */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t ILSRC;                              /**< Interleaving Source Address                        */
  uint32_t       RESERVED1[3U];                      /**< Reserved for future use                            */
} LDMA_CH_TypeDef;

/***************************************************************************//**
 * @defgroup EFM32HG310F64_Peripheral_TypeDefs EFM32HG310F64 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 ******************************************************************************/

// #include "efm32hg_aes.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_dma_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_dma.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_usb_diep.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_usb_doep.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_usb.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_msc.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_emu.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_rmu.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_cmu.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_timer.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_acmp.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_usart.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_prs_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_prs.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_idac.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_gpio.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_vcmp.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_adc.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_leuart.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_i2c.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_rtc.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_wdog.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_mtb.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_devinfo.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_romtable.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_calibrate.h"  // Note: Changed for MikroE implementation.

/** @} End of group EFM32HG310F64_Peripheral_TypeDefs */

/***************************************************************************//**
 * @defgroup EFM32HG310F64_Peripheral_Base EFM32HG310F64 Peripheral Memory Map
 * @{
 ******************************************************************************/

#define AES_BASE          (0x400E0000UL) /**< AES base address  */
#define DMA_BASE          (0x400C2000UL) /**< DMA base address  */
#define USB_BASE          (0x400C4000UL) /**< USB base address  */
#define MSC_BASE          (0x400C0000UL) /**< MSC base address  */
#define EMU_BASE          (0x400C6000UL) /**< EMU base address  */
#define RMU_BASE          (0x400CA000UL) /**< RMU base address  */
#define CMU_BASE          (0x400C8000UL) /**< CMU base address  */
#define TIMER0_BASE       (0x40010000UL) /**< TIMER0 base address  */
#define TIMER1_BASE       (0x40010400UL) /**< TIMER1 base address  */
#define TIMER2_BASE       (0x40010800UL) /**< TIMER2 base address  */
#define ACMP0_BASE        (0x40001000UL) /**< ACMP0 base address  */
#define USART0_BASE       (0x4000C000UL) /**< USART0 base address  */
#define USART1_BASE       (0x4000C400UL) /**< USART1 base address  */
#define PRS_BASE          (0x400CC000UL) /**< PRS base address  */
#define IDAC0_BASE        (0x40004000UL) /**< IDAC0 base address  */
#define GPIO_BASE         (0x40006000UL) /**< GPIO base address  */
#define VCMP_BASE         (0x40000000UL) /**< VCMP base address  */
#define ADC0_BASE         (0x40002000UL) /**< ADC0 base address  */
#define LEUART0_BASE      (0x40084000UL) /**< LEUART0 base address  */
#define PCNT0_BASE        (0x40086000UL) /**< PCNT0 base address  */
#define I2C0_BASE         (0x4000A000UL) /**< I2C0 base address  */
#define RTC_BASE          (0x40080000UL) /**< RTC base address  */
#define WDOG_BASE         (0x40088000UL) /**< WDOG base address  */
#define MTB_BASE          (0xF0040000UL) /**< MTB base address  */
#define CALIBRATE_BASE    (0x0FE08000UL) /**< CALIBRATE base address */
#define DEVINFO_BASE      (0x0FE081B0UL) /**< DEVINFO base address */
#define ROMTABLE_BASE     (0xF00FFFD0UL) /**< ROMTABLE base address */
#define LOCKBITS_BASE     (0x0FE04000UL) /**< Lock-bits page base address */
#define USERDATA_BASE     (0x0FE00000UL) /**< User data page base address */

/** @} End of group EFM32HG310F64_Peripheral_Base */

/***************************************************************************//**
 * @defgroup EFM32HG310F64_Peripheral_Declaration  EFM32HG310F64 Peripheral Declarations
 * @{
 ******************************************************************************/

#define AES          ((AES_TypeDef *) AES_BASE)             /**< AES base pointer */
#define DMA          ((DMA_TypeDef *) DMA_BASE)             /**< DMA base pointer */
#define USB          ((USB_TypeDef *) USB_BASE)             /**< USB base pointer */
#define MSC          ((MSC_TypeDef *) MSC_BASE)             /**< MSC base pointer */
#define EMU          ((EMU_TypeDef *) EMU_BASE)             /**< EMU base pointer */
#define RMU          ((RMU_TypeDef *) RMU_BASE)             /**< RMU base pointer */
#define CMU          ((CMU_TypeDef *) CMU_BASE)             /**< CMU base pointer */
#define TIMER0       ((TIMER_TypeDef *) TIMER0_BASE)        /**< TIMER0 base pointer */
#define TIMER1       ((TIMER_TypeDef *) TIMER1_BASE)        /**< TIMER1 base pointer */
#define TIMER2       ((TIMER_TypeDef *) TIMER2_BASE)        /**< TIMER2 base pointer */
#define ACMP0        ((ACMP_TypeDef *) ACMP0_BASE)          /**< ACMP0 base pointer */
#define USART0       ((USART_TypeDef *) USART0_BASE)        /**< USART0 base pointer */
#define USART1       ((USART_TypeDef *) USART1_BASE)        /**< USART1 base pointer */
#define PRS          ((PRS_TypeDef *) PRS_BASE)             /**< PRS base pointer */
#define IDAC0        ((IDAC_TypeDef *) IDAC0_BASE)          /**< IDAC0 base pointer */
#define GPIO         ((GPIO_TypeDef *) GPIO_BASE)           /**< GPIO base pointer */
#define VCMP         ((VCMP_TypeDef *) VCMP_BASE)           /**< VCMP base pointer */
#define ADC0         ((ADC_TypeDef *) ADC0_BASE)            /**< ADC0 base pointer */
#define LEUART0      ((LEUART_TypeDef *) LEUART0_BASE)      /**< LEUART0 base pointer */
#define PCNT0        ((PCNT_TypeDef *) PCNT0_BASE)          /**< PCNT0 base pointer */
#define I2C0         ((I2C_TypeDef *) I2C0_BASE)            /**< I2C0 base pointer */
#define RTC          ((RTC_TypeDef *) RTC_BASE)             /**< RTC base pointer */
#define WDOG         ((WDOG_TypeDef *) WDOG_BASE)           /**< WDOG base pointer */
#define MTB          ((MTB_TypeDef *) MTB_BASE)             /**< MTB base pointer */
#define CALIBRATE    ((CALIBRATE_TypeDef *) CALIBRATE_BASE) /**< CALIBRATE base pointer */
#define DEVINFO      ((DEVINFO_TypeDef *) DEVINFO_BASE)     /**< DEVINFO base pointer */
#define ROMTABLE     ((ROMTABLE_TypeDef *) ROMTABLE_BASE)   /**< ROMTABLE base pointer */

/** @} End of group EFM32HG310F64_Peripheral_Declaration */

/***************************************************************************//**
 * @defgroup EFM32HG310F64_BitFields EFM32HG310F64 Bit Fields
 * @{
 ******************************************************************************/

// #include "efm32hg_prs_signals.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_dmareq.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_dmactrl.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EFM32HG310F64_UNLOCK EFM32HG310F64 Unlock Codes
 * @{
 ******************************************************************************/
#define MSC_UNLOCK_CODE      0x1B71 /**< MSC unlock code */
#define EMU_UNLOCK_CODE      0xADE8 /**< EMU unlock code */
#define CMU_UNLOCK_CODE      0x580E /**< CMU unlock code */
#define TIMER_UNLOCK_CODE    0xCE80 /**< TIMER unlock code */
#define GPIO_UNLOCK_CODE     0xA534 /**< GPIO unlock code */

/** @} End of group EFM32HG310F64_UNLOCK */

/** @} End of group EFM32HG310F64_BitFields */

/***************************************************************************//**
 * @defgroup EFM32HG310F64_Alternate_Function EFM32HG310F64 Alternate Function
 * @{
 ******************************************************************************/

// #include "efm32hg_af_ports.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_af_pins.h"  // Note: Changed for MikroE implementation.

/** @} End of group EFM32HG310F64_Alternate_Function */

/***************************************************************************//**
 *  @brief Set the value of a bit field within a register.
 *
 *  @param REG
 *       The register to up2026-03-12
 *  @param MASK
 *       The mask for the bit field to up2026-03-12
 *  @param VALUE
 *       The value to write to the bit field
 *  @param OFFSET
 *       The number of bits that the field is offset within the register.
 *       0 (zero) means LSB.
 ******************************************************************************/
#define SET_BIT_FIELD(REG, MASK, VALUE, OFFSET) \
  REG = ((REG) &~(MASK)) | (((VALUE) << (OFFSET)) & (MASK));

/** @} End of group EFM32HG310F64 */

/** @} End of group Parts */

#ifdef __cplusplus
}
#endif

#endif /* EFM32HG310F64_H */
